In [1]:
import numpy as np
import pandas as pd

In [2]:
transactions = pd.read_csv('data-files/trx_data.csv')

In [3]:
transactions.info()
transactions.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62483 entries, 0 to 62482
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerId  62483 non-null  int64
 1   products    62483 non-null  object
dtypes: int64(1), object(1)
memory usage: 976.4+ KB

   customerId                        products
0           0                              20
1           1  2|2|23|68|68|111|29|86|107|152
2           2       111|107|29|11|11|11|33|23
3           3                         164|227
4           5                             2|2

In [4]:
products = transactions['products'].str.split('|')
products

0                                             [20]
1        [2, 2, 23, 68, 68, 111, 29, 86, 107, 152]
2               [111, 107, 29, 11, 11, 11, 33, 23]
3                                       [164, 227]
4                                           [2, 2]
                           ...
62478                       [103, 103, 8, 48, 126]
62479    [124, 37, 37, 78, 124, 124, 37, 8, 35, 8]
62480                                         [24]
62481                                        [167]
62482                                        [150]
Name: products, Length: 62483, dtype: object

In [6]:
transactions['products'] = products.map(lambda x : [ int(v) for v in x])

In [7]:
transactions.head()

   customerId                                   products
0           0                                       [20]
1           1  [2, 2, 23, 68, 68, 111, 29, 86, 107, 152]
2           2         [111, 107, 29, 11, 11, 11, 33, 23]
3           3                                 [164, 227]
4           5                                     [2, 2]

In [8]:
data_list = []
for idx, transaction in transactions.iterrows():
    for product in transaction['products']:
        data_list.append({ 'customerId': transaction['customerId'], 'productId': product })

In [9]:
data_list[:5]

[{'customerId': 0, 'productId': 20},
 {'customerId': 1, 'productId': 2},
 {'customerId': 1, 'productId': 2},
 {'customerId': 1, 'productId': 23},
 {'customerId': 1, 'productId': 68}]

In [10]:
data = pd.DataFrame(data_list)
data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211478 entries, 0 to 211477
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   customerId  211478 non-null  int64
 1   productId   211478 non-null  int64
dtypes: int64(2)
memory usage: 3.2 MB

   customerId  productId
0           0         20
1           1          2
2           1          2
3           1         23
4           1         68

In [11]:
data['purchase_count'] = np.ones(len(data))

In [12]:
data.head()

   customerId  productId  purchase_count
0           0         20             1.0
1           1          2             1.0
2           1          2             1.0
3           1         23             1.0
4           1         68             1.0

In [15]:
data = data.groupby(['customerId', 'productId'], as_index=False).count()

In [18]:
print( data['purchase_count'].describe() )
data.head()

count    133585.000000
mean          1.583097
std           1.116338
min           1.000000
25%           1.000000
50%           1.000000
75%           2.000000
max          75.000000
Name: purchase_count, dtype: float64

   customerId  productId  purchase_count
0           0          1               2
1           0         13               1
2           0         19               3
3           0         20               1
4           0         31               2